# 練習問題：Pandasの使い方

## 問1

In [1]:
# Pandasをインポート
import pandas as pd

# sample.csvを読み込み
df = pd.read_csv("pandas_sample.csv")

In [2]:
df

        name  age     pref
0     Tanaka   25    Tokyo
1     Suzuki   30  Saitama
2       Sato   20    Aichi
3    Nishino   49     Saga
4     Oosawa   58   Kouchi
5  Ishibashi   42    Tokyo
6   Katagiri   21  Fukuoka
7       Mita   35    Tokyo
8   Fujisawa   47  Ibaraki
9       Oota   17  Okinawa

## 問2

In [3]:
df.head()

      name  age     pref
0   Tanaka   25    Tokyo
1   Suzuki   30  Saitama
2     Sato   20    Aichi
3  Nishino   49     Saga
4   Oosawa   58   Kouchi

## 問3

In [4]:
# 行と列それぞれ1つおきにデータを表示(列は列番号で指定)
df.iloc[::2, ::2]

       name     pref
0    Tanaka    Tokyo
2      Sato    Aichi
4    Oosawa   Kouchi
6  Katagiri  Fukuoka
8  Fujisawa  Ibaraki

## 問5

In [5]:
# 35歳以上でprefが'tokyo'のデータを表示
df.query("age >= 35 and pref == 'Tokyo'")

        name  age   pref
5  Ishibashi   42  Tokyo
7       Mita   35  Tokyo